MOVE 0 TO WS-COUNTER. 
PERFORM VARYING WS-SUBSCRIPT FROM 1 BY 1 UNTIL WS-SUBSCRIPT >= 11
 ADD 1 TO WS-COUNTER
END-PERFORM. 
DISPLAY "The final value of WS-COUNTER is:" WS-COUNTER.